snppr/app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-09 02:58:54.277390"], ["title", "Family"], ["updated_at", "2014-10-09 02:58:54.277390"]]
---
	def create
	   	@category = Category.create(category_params)