snppr/app/controllers/sessions_controller.rb

  def create
     begin
            user = User.find_by({email: params[:session][:email]})
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = '' LIMIT 1