snppr/app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-13 17:46:34.298683"], ["title", ""], ["updated_at", "2014-10-13 17:46:34.298683"]]
---
  def create
    @url = Url.new(params.require(:url).permit!)

    if @url.save

SELECT  "urls".* FROM "urls"  WHERE "urls"."slug" = 'index' LIMIT 1
SELECT "images".* FROM "images"  WHERE "images"."url_id" = $1  [["url_id", 1]]
UPDATE "images" SET "alt_text" = $1, "updated_at" = $2 WHERE "images"."id" = 1  [["alt_text", "index.html"], ["updated_at", "2014-10-13 17:46:37.659774"]]
SELECT "webs".* FROM "webs"  WHERE "webs"."url_id" = $1  [["url_id", 1]]
---
  def show
    @url = Url.find_by(slug: params[:id])
    @url.images.each do |i|
      if i.alt_text == nil
        i.alt_text = image_scrape(i.link)
        i.save
      end
    end
    @url.webs.each do |w|