app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-15 02:37:06.281619"], ["title", "Family"], ["updated_at", "2014-10-15 02:37:06.281619"]]
---
	def create
<<<<<<< HEAD:snppr/app/controllers/categories_controller.rb