app/controllers/users_controller.rb

INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-15 02:37:06.684878"], ["title", "Untitled Links"], ["updated_at", "2014-10-15 02:37:06.684878"]]
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    @default = @user.categories.build(title: "Untitled Links")
    @default.save